<os_x_configuration_profile>
    <general>
      <name>Approved Kernel Extensions: MalwareBytes</name>
      <description/>
      <site/>
      <category>
        <name>Security</name>
      </category>
      <distribution_method>Install Automatically</distribution_method>
      <user_removable>false</user_removable>
      <level>System</level>
      <uuid/>
      <redeploy_on_update>Newly Assigned</redeploy_on_update>
        <payloads><?xml version="1.0" encoding="UTF-8"?>
            <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
            <plist version="1">
            <dict>
            <key>PayloadType</key>
            <string>Configuration</string>
            <key>PayloadDisplayName</key>
            <string>Approved Kernel Extensions: MalwareBytes</string>
            <key>PayloadDescription</key>
            <string/>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>PayloadEnabled</key>
            <true/>
            <key>PayloadRemovalDisallowed</key>
            <true/>
            <key>PayloadScope</key>
            <string>System</string>
            <key>PayloadContent</key>
            <array>
              <dict>
                <key>PayloadType</key>
                <string>com.apple.syspolicy.kernel-extension-policy</string>
                <key>PayloadDisplayName</key>
                <string>Approved Kernel Extensions</string>
                <key>PayloadDescription</key>
                <string/>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PayloadEnabled</key>
                <true/>
                <key>AllowUserOverrides</key>
                <true/>
                <key>AllowNonAdminUserApprovals</key>
                <false/>
                <key>AllowedTeamIdentifiers</key>
                <array>
                  <string>GVZRY6KDKR</string>
                </array>
              </dict>
              <key/>
              <dict>
                <key>UserConfiguredPayloads</key>
                <array>
                  <string>com.apple.syspolicy.kernel-extension-policy</string>
                </array>
                <key>PayloadDescription</key>
                <string/>
                <key>PayloadOrganization</key>
                <string>JAMF</string>
                <key>PayloadIdentifier</key>
                <string>5F491588-F510-46CF-827F-D446A4036197</string>
                <key>PayloadEnabled</key>
                <true/>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PayloadUUID</key>
                <string>5F491588-F510-46CF-827F-D446A4036197</string>
                <key>PayloadType</key>
                <string>com.jamfsoftware.jss.mdm.ipcu.payloads.JAMFProfileMetadata</string>
                <key>PayloadDisplayName</key>
                <string>Configuration Profile Metadata</string>
              </dict>
            </array>
            </dict>
            </plist>
            </payloads>
    </general>
    <scope>
      <all_computers>false</all_computers>
      <all_jss_users>false</all_jss_users>
      <computers/>
      <buildings/>
      <departments/>
      <computer_groups>
        <computer_group>
          <id>28</id>
          <name>OS: Earlier Than 10.15</name>
        </computer_group>
      </computer_groups>
      <jss_users/>
      <jss_user_groups/>
      <limitations>
        <users/>
        <user_groups/>
        <network_segments/>
        <ibeacons/>
      </limitations>
      <exclusions>
        <computers/>
        <buildings/>
        <departments/>
        <computer_groups>
          <computer_group>
            <id>24</id>
            <name>User Approved MDM: Is NO</name>
          </computer_group>
        </computer_groups>
        <users/>
        <user_groups/>
        <network_segments/>
        <ibeacons/>
        <jss_users/>
        <jss_user_groups/>
      </exclusions>
    </scope>
    <self_service>
      <self_service_display_name>Approved Kernel Extensions: MalwareBytes</self_service_display_name>
      <install_button_text>Install</install_button_text>
      <self_service_description/>
      <force_users_to_view_description>false</force_users_to_view_description>
      <security>
        <removal_disallowed>Never</removal_disallowed>
      </security>
      <self_service_icon/>
      <feature_on_main_page>false</feature_on_main_page>
      <self_service_categories>
        <category>
          <name>Security</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
      </self_service_categories>
    </self_service>
  </os_x_configuration_profile>
