<os_x_configuration_profile>
    <general>
      <name>Approved Kernel Extensions: MalwareBytes</name>
      <description/>
      <site/>
      <category>
        <name>Security</name>
      </category>
      <distribution_method>Install Automatically</distribution_method>
      <user_removable>false</user_removable>
      <level>System</level>
      <uuid/>
      <redeploy_on_update>Newly Assigned</redeploy_on_update>
      <payloads>&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
&lt;plist version="1"&gt;&lt;dict&gt;&lt;key&gt;PayloadUUID&lt;/key&gt;&lt;string&gt;FB96D59D-F560-42D1-B76D-4ACB5FB2DF68&lt;/string&gt;&lt;key&gt;PayloadType&lt;/key&gt;&lt;string&gt;Configuration&lt;/string&gt;&lt;key&gt;PayloadOrganization&lt;/key&gt;&lt;string&gt;Electric, AI Inc&lt;/string&gt;&lt;key&gt;PayloadIdentifier&lt;/key&gt;&lt;string&gt;FB96D59D-F560-42D1-B76D-4ACB5FB2DF68&lt;/string&gt;&lt;key&gt;PayloadDisplayName&lt;/key&gt;&lt;string&gt;Approved Kernel Extensions: MalwareBytes&lt;/string&gt;&lt;key&gt;PayloadDescription&lt;/key&gt;&lt;string/&gt;&lt;key&gt;PayloadVersion&lt;/key&gt;&lt;integer&gt;1&lt;/integer&gt;&lt;key&gt;PayloadEnabled&lt;/key&gt;&lt;true/&gt;&lt;key&gt;PayloadRemovalDisallowed&lt;/key&gt;&lt;true/&gt;&lt;key&gt;PayloadScope&lt;/key&gt;&lt;string&gt;System&lt;/string&gt;&lt;key&gt;PayloadContent&lt;/key&gt;&lt;array&gt;&lt;dict&gt;&lt;key&gt;PayloadUUID&lt;/key&gt;&lt;string&gt;C691AA57-F5F2-4EA4-A45C-B4D5CE7FD94B&lt;/string&gt;&lt;key&gt;PayloadType&lt;/key&gt;&lt;string&gt;com.apple.syspolicy.kernel-extension-policy&lt;/string&gt;&lt;key&gt;PayloadOrganization&lt;/key&gt;&lt;string&gt;Electric, AI Inc&lt;/string&gt;&lt;key&gt;PayloadIdentifier&lt;/key&gt;&lt;string&gt;C691AA57-F5F2-4EA4-A45C-B4D5CE7FD94B&lt;/string&gt;&lt;key&gt;PayloadDisplayName&lt;/key&gt;&lt;string&gt;Approved Kernel Extensions&lt;/string&gt;&lt;key&gt;PayloadDescription&lt;/key&gt;&lt;string/&gt;&lt;key&gt;PayloadVersion&lt;/key&gt;&lt;integer&gt;1&lt;/integer&gt;&lt;key&gt;PayloadEnabled&lt;/key&gt;&lt;true/&gt;&lt;key&gt;AllowUserOverrides&lt;/key&gt;&lt;true/&gt;&lt;key&gt;AllowNonAdminUserApprovals&lt;/key&gt;&lt;false/&gt;&lt;key&gt;AllowedTeamIdentifiers&lt;/key&gt;&lt;array&gt;&lt;string&gt;GVZRY6KDKR&lt;/string&gt;&lt;/array&gt;&lt;/dict&gt;&lt;/array&gt;&lt;/dict&gt;&lt;/plist&gt;</payloads>
    </general>
    <scope>
      <all_computers>false</all_computers>
      <all_jss_users>false</all_jss_users>
      <computers/>
      <buildings/>
      <departments/>
      <computer_groups/>
      <jss_users/>
      <jss_user_groups/>
      <limitations>
        <users/>
        <user_groups/>
        <network_segments/>
        <ibeacons/>
      </limitations>
      <exclusions>
        <computers/>
        <buildings/>
        <departments/>
        <computer_groups/>
        <users/>
        <user_groups/>
        <network_segments/>
        <ibeacons/>
        <jss_users/>
        <jss_user_groups/>
      </exclusions>
    </scope>
    <self_service>
      <self_service_display_name>Approved Kernel Extensions: MalwareBytes</self_service_display_name>
      <install_button_text>Install</install_button_text>
      <self_service_description/>
      <force_users_to_view_description>false</force_users_to_view_description>
      <security>
        <removal_disallowed>Never</removal_disallowed>
      </security>
      <self_service_icon/>
      <feature_on_main_page>false</feature_on_main_page>
      <self_service_categories>
        <category>
          <name>Security</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
      </self_service_categories>
    </self_service>
  </os_x_configuration_profile>
