<os_x_configuration_profile>
    <general>
      <id>-1</id>
      <name>Approved System Extensions: Malwarebytes</name>
      <description/>
      <site>
        <id>-1</id>
        <name>None</name>
      </site>
      <category>
        <id>-1</id>
        <name>Security</name>
      </category>
      <distribution_method>Install Automatically</distribution_method>
      <user_removable>false</user_removable>
      <level>System</level>
      <uuid>1C77AAEE-6210-483A-AE28-30384AF92768</uuid>
      <redeploy_on_update>Newly Assigned</redeploy_on_update>
      <payloads>&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
&lt;plist version="1"&gt;&lt;dict&gt;&lt;key&gt;PayloadUUID&lt;/key&gt;&lt;string&gt;1C77AAEE-6210-483A-AE28-30384AF92768&lt;/string&gt;&lt;key&gt;PayloadType&lt;/key&gt;&lt;string&gt;Configuration&lt;/string&gt;&lt;key&gt;PayloadOrganization&lt;/key&gt;&lt;string&gt;Electric, AI Inc&lt;/string&gt;&lt;key&gt;PayloadIdentifier&lt;/key&gt;&lt;string&gt;1C77AAEE-6210-483A-AE28-30384AF92768&lt;/string&gt;&lt;key&gt;PayloadDisplayName&lt;/key&gt;&lt;string&gt;Approved System Extensions: Malwarebytes&lt;/string&gt;&lt;key&gt;PayloadDescription&lt;/key&gt;&lt;string/&gt;&lt;key&gt;PayloadVersion&lt;/key&gt;&lt;integer&gt;1&lt;/integer&gt;&lt;key&gt;PayloadEnabled&lt;/key&gt;&lt;true/&gt;&lt;key&gt;PayloadRemovalDisallowed&lt;/key&gt;&lt;true/&gt;&lt;key&gt;PayloadScope&lt;/key&gt;&lt;string&gt;System&lt;/string&gt;&lt;key&gt;PayloadContent&lt;/key&gt;&lt;array&gt;&lt;dict&gt;&lt;key&gt;PayloadUUID&lt;/key&gt;&lt;string&gt;821E3BD8-14BC-47CF-AA1C-9F1295A513CD&lt;/string&gt;&lt;key&gt;PayloadType&lt;/key&gt;&lt;string&gt;com.apple.system-extension-policy&lt;/string&gt;&lt;key&gt;PayloadOrganization&lt;/key&gt;&lt;string&gt;Electric, AI Inc&lt;/string&gt;&lt;key&gt;PayloadIdentifier&lt;/key&gt;&lt;string&gt;821E3BD8-14BC-47CF-AA1C-9F1295A513CD&lt;/string&gt;&lt;key&gt;PayloadDisplayName&lt;/key&gt;&lt;string&gt;System Extensions&lt;/string&gt;&lt;key&gt;PayloadDescription&lt;/key&gt;&lt;string/&gt;&lt;key&gt;PayloadVersion&lt;/key&gt;&lt;integer&gt;1&lt;/integer&gt;&lt;key&gt;PayloadEnabled&lt;/key&gt;&lt;true/&gt;&lt;key&gt;AllowUserOverrides&lt;/key&gt;&lt;true/&gt;&lt;key&gt;AllowedSystemExtensions&lt;/key&gt;&lt;dict&gt;&lt;key&gt;GVZRY6KDKR&lt;/key&gt;&lt;array&gt;&lt;string&gt;com.malwarebytes.edr.helper.ext&lt;/string&gt;&lt;/array&gt;&lt;/dict&gt;&lt;/dict&gt;&lt;dict&gt;&lt;key&gt;FilterDataProviderBundleIdentifier&lt;/key&gt;&lt;string&gt;com.malwarebytes.edr.helper.ext&lt;/string&gt;&lt;key&gt;FilterDataProviderDesignatedRequirement&lt;/key&gt;&lt;string&gt;anchor apple generic and identifier "com.malwarebytes.edr.helper.ext" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GVZRY6KDKR)&lt;/string&gt;&lt;key&gt;FilterPacketProviderBundleIdentifier&lt;/key&gt;&lt;string&gt;com.malwarebytes.edr.helper.ext&lt;/string&gt;&lt;key&gt;FilterPacketProviderDesignatedRequirement&lt;/key&gt;&lt;string&gt;anchor apple generic and identifier "com.malwarebytes.edr.helper.ext" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GVZRY6KDKR)&lt;/string&gt;&lt;key&gt;FilterPackets&lt;/key&gt;&lt;true/&gt;&lt;key&gt;FilterSockets&lt;/key&gt;&lt;true/&gt;&lt;key&gt;FilterType&lt;/key&gt;&lt;string&gt;Plugin&lt;/string&gt;&lt;key&gt;PayloadDisplayName&lt;/key&gt;&lt;string&gt;Web Content Filter Payload&lt;/string&gt;&lt;key&gt;PayloadIdentifier&lt;/key&gt;&lt;string&gt;96B0A2DB-1447-45A5-A987-ED487A375664&lt;/string&gt;&lt;key&gt;PayloadOrganization&lt;/key&gt;&lt;string&gt;JAMF Software&lt;/string&gt;&lt;key&gt;PayloadType&lt;/key&gt;&lt;string&gt;com.apple.webcontent-filter&lt;/string&gt;&lt;key&gt;PayloadUUID&lt;/key&gt;&lt;string&gt;96B0A2DB-1447-45A5-A987-ED487A375664&lt;/string&gt;&lt;key&gt;PayloadVersion&lt;/key&gt;&lt;integer&gt;1&lt;/integer&gt;&lt;key&gt;PluginBundleID&lt;/key&gt;&lt;string&gt;com.malwarebytes.edr.helper&lt;/string&gt;&lt;key&gt;UserDefinedName&lt;/key&gt;&lt;string&gt;Malwarebytes Endpoint Detection and Response&lt;/string&gt;&lt;/dict&gt;&lt;/array&gt;&lt;/dict&gt;&lt;/plist&gt;</payloads>
    </general>
    <scope>
      <all_computers>true</all_computers>
      <all_jss_users>true</all_jss_users>
      <computers/>
      <buildings/>
      <departments/>
      <computer_groups/>
      <jss_users/>
      <jss_user_groups/>
      <limitations>
        <users/>
        <user_groups/>
        <network_segments/>
        <ibeacons/>
      </limitations>
      <exclusions>
        <computers/>
        <buildings/>
        <departments/>
        <computer_groups>
          <computer_group>
            <id>-1</id>
            <name>OS: Earlier Than 10.15</name>
          </computer_group>
          <computer_group>
            <id>-1</id>
            <name>User Approved MDM: Is NO</name>
          </computer_group>
        </computer_groups>
        <users/>
        <user_groups/>
        <network_segments/>
        <ibeacons/>
        <jss_users/>
        <jss_user_groups/>
      </exclusions>
    </scope>
    <self_service>
      <self_service_display_name>Approved System Extensions: Malwarebytes</self_service_display_name>
      <install_button_text>Install</install_button_text>
      <self_service_description/>
      <force_users_to_view_description>false</force_users_to_view_description>
      <security>
        <removal_disallowed>Never</removal_disallowed>
      </security>
      <self_service_icon/>
      <feature_on_main_page>false</feature_on_main_page>
      <self_service_categories>
        <category>
          <id>-1</id>
          <name>Security</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
      </self_service_categories>
    </self_service>
  </os_x_configuration_profile>
